```
var.app
  The application name (ab2d, bcda, dpc)

  Enter a value: ab2d

var.env
  The application environment (dev, test, mgmt, sbx, prod)

  Enter a value: dev

module.vpc.data.aws_vpc.this: Reading...
module.vpc.data.aws_vpc.this: Read complete after 1s [id=vpc-0c6413ec40c5fdac3]

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.zscaler_private will be created
  + resource "aws_security_group" "zscaler_private" {
      + arn                    = (known after apply)
      + description            = "Allow internet zscaler traffic private"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ab2d-dev-allow-zscaler-private"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/zscaler-security-groups"
          + "terraform" = "true"
        }
      + vpc_id                 = "vpc-0c6413ec40c5fdac3"
    }

  # aws_security_group.zscaler_public will be created
  + resource "aws_security_group" "zscaler_public" {
      + arn                    = (known after apply)
      + description            = "Allow public zscaler traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ab2d-dev-allow-zscaler-public"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "business"  = "oeda"
          + "code"      = "https://github.com/CMSgov/ab2d-bcda-dpc-platform/tree/main/terraform/services/zscaler-security-groups"
          + "terraform" = "true"
        }
      + vpc_id                 = "vpc-0c6413ec40c5fdac3"
    }

  # aws_security_group_rule.zscaler_allow_private will be created
  + resource "aws_security_group_rule" "zscaler_allow_private" {
      + cidr_blocks              = [
          + "10.223.126.64/27",
          + "10.223.126.96/28",
          + "10.220.126.64/27",
          + "10.220.126.96/28",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # aws_security_group_rule.zscaler_allow_public will be created
  + resource "aws_security_group_rule" "zscaler_allow_public" {
      + cidr_blocks              = [
          + "65.213.206.0/24",
          + "208.250.57.0/24",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```